---
title: AssetPropertyDoubleArray4d
classe: Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray4d
namespace: Autodesk.Revit.DB.Visual
eredita: Autodesk.Revit.DB.Visual.AssetProperty
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# AssetPropertyDoubleArray4d

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Color GetValueAsColor()` | `assetPropertyDoubleArray4d.GetValueAsColor()` | Color |
| `IList<Double> GetValueAsDoubles()` | `assetPropertyDoubleArray4d.GetValueAsDoubles()` | IList<Double> |
| `Boolean IsValidValue(Color)` | `assetPropertyDoubleArray4d.IsValidValue(color)` | Boolean |
| `Boolean IsValidValue(IList<Double>)` | `assetPropertyDoubleArray4d.IsValidValue(value)` | Boolean |
| `Void SetValueAsColor(Color)` | `assetPropertyDoubleArray4d.SetValueAsColor(color)` | Void |
| `Void SetValueAsDoubles(IList<Double>)` | `assetPropertyDoubleArray4d.SetValueAsDoubles(value)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```